版本歷史字典 = {
    '2021.10.8 版': [
        '加入顯示單張韻圖的模式，並作爲默認模式',
        '優化表格佈局',
        '加入頁內平滑跳轉',
        '修正反切字形',
        '加入小韻數據下載鏈接',
    ],
    '2021.9.30 測試版': [
        '適配手機端屏幕尺寸',
        '在標題後添加“回到索引”',
        '使小韻信息懸浮窗不超出頁面',
    ],
    '2021.9.29 測試版': [
        '網頁版切韻新韻圖完成',
        '前期準備工作：<ul>' +
        '<li>7.31 修訂一些邊緣小韻的<hanla></hanla>unt<hanla></hanla>切韻朗讀音</li>' +
        '<li>7.10 完成格子合法性判斷規則</li>' +
        '<li>6.30 完成《廣韻》爭議小韻和邊緣小韻考校</li>' +
        '<li>6.12 完成切韻新韻圖設計</li></ul>',
    ],
}
